# pandas的拼接操作

pandas的拼接分为两种：

- 级联：pd.concat, pd.append (没有重复数据)
- 合并：pd.merge, pd.join (有重复数据)

## 0. 回顾numpy的级联

============================================

练习12：

1. 生成2个3*3的矩阵，对其分别进行两个维度上的级联

============================================

In [60]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [66]:
nd1 = np.random.randint(0,10,size=(3,3))
nd2 = np.random.randint(10,100,size=(3,3))
display(nd1,nd2)
np.concatenate((nd1,nd2))
np.concatenate((nd1,nd2),axis=1)

array([[7, 4, 2],
       [2, 7, 9],
       [7, 6, 6]])

array([[69, 93, 71],
       [87, 25, 38],
       [42, 15, 35]])

array([[ 7,  4,  2, 69, 93, 71],
       [ 2,  7,  9, 87, 25, 38],
       [ 7,  6,  6, 42, 15, 35]])

## 1. 使用pd.concat()级联

为方便讲解，我们首先定义一个生成DataFrame的函数：

In [68]:
df1 = DataFrame(nd1)
df2 = DataFrame(nd2)
display(df1,df2)

   0  1  2
0  7  4  2
1  2  7  9
2  7  6  6

    0   1   2
0  69  93  71
1  87  25  38
2  42  15  35

### 1)  简单级联

pandas使用pd.concat函数，与np.concatenate函数类似

In [72]:
df3 = pd.concat((df1,df2)) #默认 axis是0 是纵向拼接
df3

    0   1   2
0   7   4   2
1   2   7   9
2   7   6   6
0  69  93  71
1  87  25  38
2  42  15  35

In [73]:
# 索引有重复 会产生一些问题
df3.loc[0]

    0   1   2
0   7   4   2
0  69  93  71

In [81]:
# 可以通过 重置索引的方式 去重新让索引不重复
# ignore_index=False 忽略原索引 建立新索引 默认是False
df3 = pd.concat((df1,df2),ignore_index=True)
df3

    0   1   2
0   7   4   2
1   2   7   9
2   7   6   6
3  69  93  71
4  87  25  38
5  42  15  35

In [87]:
display(df1,df2)

   0  1  2
0  7  4  2
1  2  7  9
2  7  6  6

    0   1   2
0  69  93  71
1  87  25  38
2  42  15  35

In [88]:
df3 = pd.concat((df1,df2),ignore_index=True,axis=0) # 默认是 0 竖直方向
df3 = pd.concat((df1,df2),axis=1) # 1 水平方向拼接
df3 = pd.concat((df1,df2),ignore_index=True,axis=1)
df3

   0  1  2   3   4   5
0  7  4  2  69  93  71
1  2  7  9  87  25  38
2  7  6  6  42  15  35

In [89]:
display(df1,df2)

   0  1  2
0  7  4  2
1  2  7  9
2  7  6  6

    0   1   2
0  69  93  71
1  87  25  38
2  42  15  35

In [91]:
df3 = pd.concat((df1,df2),keys=["第一个","第二个"])
df3

        0   1   2
第一个 0   7   4   2
    1   2   7   9
    2   7   6   6
第二个 0  69  93  71
    1  87  25  38
    2  42  15  35

### 2) 不匹配级联

不匹配指的是级联的维度的索引不一致。例如纵向级联时列索引不一致，横向级联时行索引不一致

有3种连接方式：

- 外连接：补NaN（默认模式）

- 内连接：只连接匹配的项

- 连接指定轴 join_axes

In [93]:
nd1,nd2

(array([[7, 4, 2],
        [2, 7, 9],
        [7, 6, 6]]), array([[69, 93, 71],
        [87, 25, 38],
        [42, 15, 35]]))

In [99]:
# 把相同索引的行或列进行级联，如果存在不匹配的行列标签，补nan
df3 = DataFrame(data=nd1,columns=list("ABC"))
df4 = DataFrame(data=nd2,columns=list("BCD"))
display(df3,df4)

   A  B  C
0  7  4  2
1  2  7  9
2  7  6  6

    B   C   D
0  69  93  71
1  87  25  38
2  42  15  35

In [98]:
pd.concat((df3,df4),sort=False) # dataframe 拼接 默认是 外联

     A   B   C     D
0  7.0   4   2   NaN
1  2.0   7   9   NaN
2  7.0   6   6   NaN
0  NaN  69  93  71.0
1  NaN  87  25  38.0
2  NaN  42  15  35.0

In [101]:
pd.concat((df3,df4),sort=False,) #{'inner', 'outer'}, default 'outer'
pd.concat((df3,df4),sort=False,join="inner")

    B   C
0   4   2
1   7   9
2   6   6
0  69  93
1  87  25
2  42  15

In [36]:
pd.concat((df3,df4),sort="False",axis=1,ignore_index="True")

   0  1  2   3   4   5
0  8  1  7  48  57  94
1  9  2  3  96  73  20
2  7  0  9  93  17  13

In [42]:
# 使用keys参数，可以自动设置为多层级索引，避免索引重复
pd.concat((df3,df4),sort="False")
pd.concat((df3,df4),keys=['期中','期末'],sort="False")

        A   B   C     D
期中 0  8.0   1   7   NaN
   1  9.0   2   3   NaN
   2  7.0   0   9   NaN
期末 0  NaN  48  57  94.0
   1  NaN  96  73  20.0
   2  NaN  93  17  13.0

In [45]:
pd.concat((df3,df4),sort="False",join="inner")

    B   C
0   1   7
1   2   3
2   0   9
0  48  57
1  96  73
2  93  17

In [103]:
df3

   A  B  C
0  7  4  2
1  2  7  9
2  7  6  6

In [104]:
df4

    B   C   D
0  69  93  71
1  87  25  38
2  42  15  35

In [107]:
index = pd.Index(["B","C"])
pd.concat((df3,df4),sort="False",join_axes=[index])

    B   C
0   4   2
1   7   9
2   6   6
0  69  93
1  87  25
2  42  15

In [ ]:
pd.concat() 
# 参数
#1. objs 传入列表或者元素 里面是要拼接的DataFrame
#2. axis 拼接的时候是沿着什么方向 默认值是0 纵向 如果是1就是横向
#3. join 指定了拼接的方式 默认是outer
#  outer 外联 所有的列都会拼进来
#  inner 内联 只有那些两个DataFrame都有的列才会拼进来
#4. join_axes 直接指定那些列要放进来
#5. ignore_index=False 忽略原有索引创建新的索引 （如果索引有重复可以通过忽略原索引来重置）
# 6. keys 可以把不同的DataFrame分成多组 也可以用来解决index重复的问题

In [48]:
pd.concat((df3,df4),sort="False",axis=1)

   A  B  C   B   C   D
0  8  1  7  48  57  94
1  9  2  3  96  73  20
2  7  0  9  93  17  13

In [54]:
axes = pd.Index(["B","C"])
pd.concat((df3,df4),sort="False",join_axes=[axes])

    B   C
0   1   7
1   2   3
2   0   9
0  48  57
1  96  73
2  93  17

============================================

练习13：

1. 想一想级联的应用场景？

2. 使用昨天的知识，建立一个期中考试张三、李四的成绩表df

3. 假设新增考试学科"计算机"，如何实现？

4. 新增王老五同学的成绩，如何实现？

============================================

In [113]:
import numpy as np

data = np.random.randint(0,150,size=(2,3))
index = ["张三","李四"]
columns = ["语文","数学","外语"]
df1 = DataFrame(data,index,columns)
df1

     语文  数学   外语
张三  133  34  105
李四   10  20  114

In [112]:

data = np.random.randint(0,150,size=(2,1))
index = ["张三","李四"]
columns = ["计算机"]
df2 = DataFrame(data,index,columns)
df2

    计算机
张三  102
李四   43

In [127]:
df5 = pd.concat((df1,df2),axis=1,sort=False)
df5

     语文  数学   外语  计算机
张三  133  34  105  102
李四   10  20  114   43

In [118]:
data = np.random.randint(0,150,size=(1,4))
index = ["王老五"]
columns = ["语文","数学","外语","计算机"]
df3 = DataFrame(data,index,columns)
df3

      语文   数学  外语  计算机
王老五  144  117   9   92

In [121]:
pd.concat((df1,df3),sort=False)

      语文   数学   外语   计算机
张三   133   34  105   NaN
李四    10   20  114   NaN
王老五  144  117    9  92.0

### 3) 使用append()函数添加

由于在后面级联的使用非常普遍，因此有一个函数append专门用于在后面添加

In [130]:
df5

     语文  数学   外语  计算机
张三  133  34  105  102
李四   10  20  114   43

In [126]:
df3

      语文   数学  外语  计算机
王老五  144  117   9   92

In [140]:
df6= df5.append(df3)
df6

      语文   数学   外语  计算机
张三   133   34  105  102
李四    10   20  114   43
王老五  144  117    9   92

============================================

练习15：

    新建一个只有张三李四王老五的期末考试成绩单ddd3，使用append()与期中考试成绩表ddd级联

============================================

In [155]:
data = np.random.randint(0,150,size=(3,4))
index = ["张三","李四","王老五"]
columns = ["语文","数学","外语","计算机"]
df7 = DataFrame(data,index,columns)
display(df6,df7)

      语文   数学   外语  计算机
张三   133   34  105  102
李四    10   20  114   43
王老五  144  117    9   92

      语文  数学   外语  计算机
张三    30  17  137   59
李四   130  74  110   97
王老五   50  24   38    8

In [157]:
df6.append(df7) # 只能是把行 纵向地 从后 往前 拼接

      语文   数学   外语  计算机
张三   133   34  105  102
李四    10   20  114   43
王老五  144  117    9   92
张三    30   17  137   59
李四   130   74  110   97
王老五   50   24   38    8

In [160]:
pd.concat((df6,df7),axis=1,keys=["期中","期末"])

      期中                  期末
      语文   数学   外语  计算机   语文  数学   外语 计算机
张三   133   34  105  102   30  17  137  59
李四    10   20  114   43  130  74  110  97
王老五  144  117    9   92   50  24   38   8

## 2. 使用pd.merge()合并

merge与concat的区别在于，merge需要依据某一共同的行或列来进行合并

使用pd.merge()合并时，会自动根据两者相同column名称的那一列，作为key来进行合并。

注意每一列元素的顺序不要求一致

###  1) 一对一合并

### 2) 多对一合并

### 3) 多对多合并

In [317]:
# 同学们使用这个方法可能会报错 报错会说 缺少一个库 大家通过pip安装一下就可以了
table1 = pd.read_excel("./关系表.xls",sheet_name=0)
table2 = pd.read_excel("./关系表.xls",sheet_name=1)
table3 = pd.read_excel("./关系表.xls",sheet_name=2)
table4 = pd.read_excel("./关系表.xls",sheet_name=3)
table5 = pd.read_excel("./关系表.xls",sheet_name=4)

In [289]:
display(table1,table2)

           手机型号  参考价格
0  windowsPhone  2500
1        iPhone  7500
2       Android  4000

           手机型号    重量
0  windowsPhone  0.50
1        iPhone  0.40
2       Android  0.45
3         other  0.60

In [290]:
# 一一对应的表格 通过merge融合 把数据对应上就可以了
pd.merge(table1,table2)
# how指的是如何拼接 默认是inner 内联 （两个表格都有的项目才留下）

           手机型号  参考价格    重量
0  windowsPhone  2500  0.50
1        iPhone  7500  0.40
2       Android  4000  0.45

In [294]:
# {'left', 'right', 'outer', 'inner'}, default 'inner' 
pd.merge(table1,table2)
pd.merge(table1,table2,how="inner") # inner  是取交集 两个都有的项目才出现
pd.merge(table1,table2,how="outer") # outer 是取并集 任何一个表格里出现的项目都会出现
pd.merge(table1,table2,how="left") # 左边的表格有多少项目 这里就有多少项目
pd.merge(table1,table2,how="right") # 右边的表格有多少项目 这里就有多少项目

           手机型号  参考价格    重量
0  windowsPhone  2500  0.50
1        iPhone  7500  0.40
2       Android  4000  0.45

In [300]:
# 一对多
display(table2,table3)

           手机型号    重量
0  windowsPhone  0.50
1        iPhone  0.40
2       Android  0.45
3         other  0.60

      经销商       发货地区          手机型号
0   pegge    beijing        iPhone
1    lucy    beijing       Android
2     tom  guangzhou        iPhone
3  petter   shenzhen  windowsPhone
4    mery  guangzhou       Android

In [305]:
# 一对多 的 表格拼接 两个表格需要有一个相同的column 然后在把1*多个 计算出新的行
pd.merge(table2,table3,how="inner")
pd.merge(table2,table3,how="outer")
pd.merge(table2,table3,how="left")
pd.merge(table2,table3,how="right")

           手机型号    重量     经销商       发货地区
0  windowsPhone  0.50  petter   shenzhen
1        iPhone  0.40   pegge    beijing
2        iPhone  0.40     tom  guangzhou
3       Android  0.45    lucy    beijing
4       Android  0.45    mery  guangzhou

In [306]:
# 多对多
display(table3,table4)

      经销商       发货地区          手机型号
0   pegge    beijing        iPhone
1    lucy    beijing       Android
2     tom  guangzhou        iPhone
3  petter   shenzhen  windowsPhone
4    mery  guangzhou       Android

        发货地区          手机型号    价格
0    beijing        iPhone  7000
1    beijing  windowsPhone  2300
2    beijing       Android  3600
3  guangzhou        iPhone  7600
4  guangzhou  windowsPhone  2800
5  guangzhou       Android  4200
6   shenzhen        iPhone  7400
7   shenzhen  windowsPhone  2750
8   shenzhen       Android  3900

In [311]:
# 多对多 拼接
# 方式1 我们通过on 指定 按照哪一列进行拼接 然后可以通过suffixes指定重复的列的后缀
pd.merge(table3,table4,on="手机型号",suffixes=["_1","_2"])

       经销商     发货地区_1          手机型号     发货地区_2    价格
0    pegge    beijing        iPhone    beijing  7000
1    pegge    beijing        iPhone  guangzhou  7600
2    pegge    beijing        iPhone   shenzhen  7400
3      tom  guangzhou        iPhone    beijing  7000
4      tom  guangzhou        iPhone  guangzhou  7600
5      tom  guangzhou        iPhone   shenzhen  7400
6     lucy    beijing       Android    beijing  3600
7     lucy    beijing       Android  guangzhou  4200
8     lucy    beijing       Android   shenzhen  3900
9     mery  guangzhou       Android    beijing  3600
10    mery  guangzhou       Android  guangzhou  4200
11    mery  guangzhou       Android   shenzhen  3900
12  petter   shenzhen  windowsPhone    beijing  2300
13  petter   shenzhen  windowsPhone  guangzhou  2800
14  petter   shenzhen  windowsPhone   shenzhen  2750

In [313]:
# 第二种方式 指定两个相同的列 这两列中的项目必须都对应上才会显示到新的表格中
pd.merge(table3,table4,on=["手机型号","发货地区"])

      经销商       发货地区          手机型号    价格
0   pegge    beijing        iPhone  7000
1    lucy    beijing       Android  3600
2     tom  guangzhou        iPhone  7600
3  petter   shenzhen  windowsPhone  2750
4    mery  guangzhou       Android  4200

      经销商       发货地区          手机型号
0   pegge    beijing        iPhone
1    lucy    beijing       Android
2     tom  guangzhou        iPhone
3  petter   shenzhen  windowsPhone
4    mery  guangzhou       Android

        发货地区          手机型号    价格
0    beijing        iPhone  7000
1    beijing  windowsPhone  2300
2    beijing       Android  3600
3  guangzhou        iPhone  7600
4  guangzhou  windowsPhone  2800
5  guangzhou       Android  4200
6   shenzhen        iPhone  7400
7   shenzhen  windowsPhone  2750
8   shenzhen       Android  3900

       经销商     发货地区_1          手机型号     发货地区_2    价格
0    pegge    beijing        iPhone    beijing  7000
1    pegge    beijing        iPhone  guangzhou  7600
2    pegge    beijing        iPhone   shenzhen  7400
3      tom  guangzhou        iPhone    beijing  7000
4      tom  guangzhou        iPhone  guangzhou  7600
5      tom  guangzhou        iPhone   shenzhen  7400
6     lucy    beijing       Android    beijing  3600
7     lucy    beijing       Android  guangzhou  4200
8     lucy    beijing       Android   shenzhen  3900
9     mery  guangzhou       Android    beijing  3600
10    mery  guangzhou       Android  guangzhou  4200
11    mery  guangzhou       Android   shenzhen  3900
12  petter   shenzhen  windowsPhone    beijing  2300
13  petter   shenzhen  windowsPhone  guangzhou  2800
14  petter   shenzhen  windowsPhone   shenzhen  2750

      经销商       发货地区          手机型号    价格
0   pegge    beijing        iPhone  7000
1    lucy    beijing       Android  3600
2     tom  guangzhou        iPhone  7600
3  petter   shenzhen  windowsPhone  2750
4    mery  guangzhou       Android  4200

           手机型号  参考价格
0  windowsPhone  2500
1        iPhone  7500
2       Android  4000

        发货地区            型号    价格
0    beijing        iPhone  7000
1    beijing  windowsPhone  2300
2    beijing       Android  3600
3  guangzhou        iPhone  7600
4  guangzhou  windowsPhone  2800
5  guangzhou       Android  4200
6   shenzhen        iPhone  7400
7   shenzhen  windowsPhone  2750
8   shenzhen       Android  3900

           手机型号  参考价格       发货地区    价格
0  windowsPhone  2500    beijing  2300
1  windowsPhone  2500  guangzhou  2800
2  windowsPhone  2500   shenzhen  2750
3        iPhone  7500    beijing  7000
4        iPhone  7500  guangzhou  7600
5        iPhone  7500   shenzhen  7400
6       Android  4000    beijing  3600
7       Android  4000  guangzhou  4200
8       Android  4000   shenzhen  3900

In [319]:
display(table4,table5)

        发货地区          手机型号    价格
0    beijing        iPhone  7000
1    beijing  windowsPhone  2300
2    beijing       Android  3600
3  guangzhou        iPhone  7600
4  guangzhou  windowsPhone  2800
5  guangzhou       Android  4200
6   shenzhen        iPhone  7400
7   shenzhen  windowsPhone  2750
8   shenzhen       Android  3900

             型号    价格
0        iPhone  7000
1  windowsPhone  2300
2       Android  3600
3        iPhone  7600
4  windowsPhone  2800
5       Android  4200
6        iPhone  7400
7  windowsPhone  2750
8       Android  3900

In [318]:
pd.merge(table4,table5)

        发货地区          手机型号    价格            型号
0    beijing        iPhone  7000        iPhone
1    beijing  windowsPhone  2300  windowsPhone
2    beijing       Android  3600       Android
3  guangzhou        iPhone  7600        iPhone
4  guangzhou  windowsPhone  2800  windowsPhone
5  guangzhou       Android  4200       Android
6   shenzhen        iPhone  7400        iPhone
7   shenzhen  windowsPhone  2750  windowsPhone
8   shenzhen       Android  3900       Android

### 4) key的规范化

- 使用on=显式指定哪一列为key,当有多个key相同时使用

- 使用left_on和right_on指定左右两边的列作为key，当左右两边的key都不想等时使用

============================================

练习16：

1. 假设有两份成绩单，除了ddd是张三李四王老五之外，还有ddd4是张三和赵小六的成绩单，如何合并？

2. 如果ddd4中张三的名字被打错了，成为了张十三，怎么办？

3. 自行练习多对一，多对多的情况  

4. 自学left_index,right_index

============================================

### 5) 内合并与外合并

- 内合并：只保留两者都有的key（默认模式）

- 外合并 how='outer'：补NaN

- 左合并、右合并：how='left'，how='right'，

============================================

练习17：



1. 考虑应用情景，使用多种方式合并ddd与ddd4

============================================

### 6) 列冲突的解决

当列冲突时，即有多个列名称相同时，需要使用on=来指定哪一个列作为key，配合suffixes指定冲突列名

可以使用suffixes=自己指定后缀

============================================

练习18：

    假设有两个同学都叫李四，ddd5、ddd6都是张三和李四的成绩表，如何合并？

============================================

## 作业
## 3. 案例分析：美国各州人口数据分析

作业知识补充

In [321]:
s1 = Series(["A","B","C","B"])
s1

0    A
1    B
2    C
3    B
dtype: object

In [322]:
s1.unique()

array(['A', 'B', 'C'], dtype=object)

首先导入文件，并查看数据样本

In [325]:
df_abbr = pd.read_csv("../data/state-abbrevs.csv") # csv文件的数据导入后 会变成DataFrame供我们使用
df_abbr.shape

(51, 2)

In [326]:
df_areas = pd.read_csv("../data/state-areas.csv") # csv文件的数据导入后 会变成DataFrame供我们使用
df_areas

                   state  area (sq. mi)
0                Alabama          52423
1                 Alaska         656425
2                Arizona         114006
3               Arkansas          53182
4             California         163707
5               Colorado         104100
6            Connecticut           5544
7               Delaware           1954
8                Florida          65758
9                Georgia          59441
10                Hawaii          10932
11                 Idaho          83574
12              Illinois          57918
13               Indiana          36420
14                  Iowa          56276
15                Kansas          82282
16              Kentucky          40411
17             Louisiana          51843
18                 Maine          35387
19              Maryland          12407
20         Massachusetts          10555
21              Michigan          96810
22             Minnesota          86943
23           Mississippi          48434
24              Missouri          69709
25               Montana         147046
26              Nebraska          77358
27                Nevada         110567
28         New Hampshire           9351
29            New Jersey           8722
30            New Mexico         121593
31              New York          54475
32        North Carolina          53821
33          North Dakota          70704
34                  Ohio          44828
35              Oklahoma          69903
36                Oregon          98386
37          Pennsylvania          46058
38          Rhode Island           1545
39        South Carolina          32007
40          South Dakota          77121
41             Tennessee          42146
42                 Texas         268601
43                  Utah          84904
44               Vermont           9615
45              Virginia          42769
46            Washington          71303
47         West Virginia          24231
48             Wisconsin          65503
49               Wyoming          97818
50  District of Columbia             68
51           Puerto Rico           3515

In [329]:
df_pop = pd.read_csv("../data/state-population.csv") # csv文件的数据导入后 会变成DataFrame供我们使用
df_pop

     state/region     ages  year   population
0              AL  under18  2012    1117489.0
1              AL    total  2012    4817528.0
2              AL  under18  2010    1130966.0
3              AL    total  2010    4785570.0
4              AL  under18  2011    1125763.0
5              AL    total  2011    4801627.0
6              AL    total  2009    4757938.0
7              AL  under18  2009    1134192.0
8              AL  under18  2013    1111481.0
9              AL    total  2013    4833722.0
10             AL    total  2007    4672840.0
11             AL  under18  2007    1132296.0
12             AL    total  2008    4718206.0
13             AL  under18  2008    1134927.0
14             AL    total  2005    4569805.0
15             AL  under18  2005    1117229.0
16             AL    total  2006    4628981.0
17             AL  under18  2006    1126798.0
18             AL    total  2004    4530729.0
19             AL  under18  2004    1113662.0
20             AL    total  2003    4503491.0
21             AL  under18  2003    1113083.0
22             AL    total  2001    4467634.0
23             AL  under18  2001    1120409.0
24             AL    total  2002    4480089.0
25             AL  under18  2002    1116590.0
26             AL  under18  1999    1121287.0
27             AL    total  1999    4430141.0
28             AL    total  2000    4452173.0
29             AL  under18  2000    1122273.0
...           ...      ...   ...          ...
2514          USA  under18  1999   71946051.0
2515          USA    total  2000  282162411.0
2516          USA  under18  2000   72376189.0
2517          USA    total  1999  279040181.0
2518          USA    total  2001  284968955.0
2519          USA  under18  2001   72671175.0
2520          USA    total  2002  287625193.0
2521          USA  under18  2002   72936457.0
2522          USA    total  2003  290107933.0
2523          USA  under18  2003   73100758.0
2524          USA    total  2004  292805298.0
2525          USA  under18  2004   73297735.0
2526          USA    total  2005  295516599.0
2527          USA  under18  2005   73523669.0
2528          USA    total  2006  298379912.0
2529          USA  under18  2006   73757714.0
2530          USA    total  2007  301231207.0
2531          USA  under18  2007   74019405.0
2532          USA    total  2008  304093966.0
2533          USA  under18  2008   74104602.0
2534          USA  under18  2013   73585872.0
2535          USA    total  2013  316128839.0
2536          USA    total  2009  306771529.0
2537          USA  under18  2009   74134167.0
2538          USA  under18  2010   74119556.0
2539          USA    total  2010  309326295.0
2540          USA  under18  2011   73902222.0
2541          USA    total  2011  311582564.0
2542          USA  under18  2012   73708179.0
2543          USA    total  2012  313873685.0

[2544 rows x 4 columns]

合并popu与abbrevs两个DataFrame，分别依据state/region列和abbreviation列来合并。

为了保留所有信息，使用外合并。

In [333]:
df_abbr

                   state abbreviation
0                Alabama           AL
1                 Alaska           AK
2                Arizona           AZ
3               Arkansas           AR
4             California           CA
5               Colorado           CO
6            Connecticut           CT
7               Delaware           DE
8   District of Columbia           DC
9                Florida           FL
10               Georgia           GA
11                Hawaii           HI
12                 Idaho           ID
13              Illinois           IL
14               Indiana           IN
15                  Iowa           IA
16                Kansas           KS
17              Kentucky           KY
18             Louisiana           LA
19                 Maine           ME
20               Montana           MT
21              Nebraska           NE
22                Nevada           NV
23         New Hampshire           NH
24            New Jersey           NJ
25            New Mexico           NM
26              New York           NY
27        North Carolina           NC
28          North Dakota           ND
29                  Ohio           OH
30              Oklahoma           OK
31                Oregon           OR
32              Maryland           MD
33         Massachusetts           MA
34              Michigan           MI
35             Minnesota           MN
36           Mississippi           MS
37              Missouri           MO
38          Pennsylvania           PA
39          Rhode Island           RI
40        South Carolina           SC
41          South Dakota           SD
42             Tennessee           TN
43                 Texas           TX
44                  Utah           UT
45               Vermont           VT
46              Virginia           VA
47            Washington           WA
48         West Virginia           WV
49             Wisconsin           WI
50               Wyoming           WY

In [332]:
df_pop

     state/region     ages  year   population
0              AL  under18  2012    1117489.0
1              AL    total  2012    4817528.0
2              AL  under18  2010    1130966.0
3              AL    total  2010    4785570.0
4              AL  under18  2011    1125763.0
5              AL    total  2011    4801627.0
6              AL    total  2009    4757938.0
7              AL  under18  2009    1134192.0
8              AL  under18  2013    1111481.0
9              AL    total  2013    4833722.0
10             AL    total  2007    4672840.0
11             AL  under18  2007    1132296.0
12             AL    total  2008    4718206.0
13             AL  under18  2008    1134927.0
14             AL    total  2005    4569805.0
15             AL  under18  2005    1117229.0
16             AL    total  2006    4628981.0
17             AL  under18  2006    1126798.0
18             AL    total  2004    4530729.0
19             AL  under18  2004    1113662.0
20             AL    total  2003    4503491.0
21             AL  under18  2003    1113083.0
22             AL    total  2001    4467634.0
23             AL  under18  2001    1120409.0
24             AL    total  2002    4480089.0
25             AL  under18  2002    1116590.0
26             AL  under18  1999    1121287.0
27             AL    total  1999    4430141.0
28             AL    total  2000    4452173.0
29             AL  under18  2000    1122273.0
...           ...      ...   ...          ...
2514          USA  under18  1999   71946051.0
2515          USA    total  2000  282162411.0
2516          USA  under18  2000   72376189.0
2517          USA    total  1999  279040181.0
2518          USA    total  2001  284968955.0
2519          USA  under18  2001   72671175.0
2520          USA    total  2002  287625193.0
2521          USA  under18  2002   72936457.0
2522          USA    total  2003  290107933.0
2523          USA  under18  2003   73100758.0
2524          USA    total  2004  292805298.0
2525          USA  under18  2004   73297735.0
2526          USA    total  2005  295516599.0
2527          USA  under18  2005   73523669.0
2528          USA    total  2006  298379912.0
2529          USA  under18  2006   73757714.0
2530          USA    total  2007  301231207.0
2531          USA  under18  2007   74019405.0
2532          USA    total  2008  304093966.0
2533          USA  under18  2008   74104602.0
2534          USA  under18  2013   73585872.0
2535          USA    total  2013  316128839.0
2536          USA    total  2009  306771529.0
2537          USA  under18  2009   74134167.0
2538          USA  under18  2010   74119556.0
2539          USA    total  2010  309326295.0
2540          USA  under18  2011   73902222.0
2541          USA    total  2011  311582564.0
2542          USA  under18  2012   73708179.0
2543          USA    total  2012  313873685.0

[2544 rows x 4 columns]

In [339]:

df_pop2 = pd.merge(df_abbr,df_pop,left_on="abbreviation",right_on="state/region",how="outer")
df_pop3 = df_pop2.drop(labels="abbreviation",axis=1)

去除abbreviation的那一列（axis=1）

In [342]:
df_pop3

        state state/region     ages  year   population
0     Alabama           AL  under18  2012    1117489.0
1     Alabama           AL    total  2012    4817528.0
2     Alabama           AL  under18  2010    1130966.0
3     Alabama           AL    total  2010    4785570.0
4     Alabama           AL  under18  2011    1125763.0
5     Alabama           AL    total  2011    4801627.0
6     Alabama           AL    total  2009    4757938.0
7     Alabama           AL  under18  2009    1134192.0
8     Alabama           AL  under18  2013    1111481.0
9     Alabama           AL    total  2013    4833722.0
10    Alabama           AL    total  2007    4672840.0
11    Alabama           AL  under18  2007    1132296.0
12    Alabama           AL    total  2008    4718206.0
13    Alabama           AL  under18  2008    1134927.0
14    Alabama           AL    total  2005    4569805.0
15    Alabama           AL  under18  2005    1117229.0
16    Alabama           AL    total  2006    4628981.0
17    Alabama           AL  under18  2006    1126798.0
18    Alabama           AL    total  2004    4530729.0
19    Alabama           AL  under18  2004    1113662.0
20    Alabama           AL    total  2003    4503491.0
21    Alabama           AL  under18  2003    1113083.0
22    Alabama           AL    total  2001    4467634.0
23    Alabama           AL  under18  2001    1120409.0
24    Alabama           AL    total  2002    4480089.0
25    Alabama           AL  under18  2002    1116590.0
26    Alabama           AL  under18  1999    1121287.0
27    Alabama           AL    total  1999    4430141.0
28    Alabama           AL    total  2000    4452173.0
29    Alabama           AL  under18  2000    1122273.0
...       ...          ...      ...   ...          ...
2514      NaN          USA  under18  1999   71946051.0
2515      NaN          USA    total  2000  282162411.0
2516      NaN          USA  under18  2000   72376189.0
2517      NaN          USA    total  1999  279040181.0
2518      NaN          USA    total  2001  284968955.0
2519      NaN          USA  under18  2001   72671175.0
2520      NaN          USA    total  2002  287625193.0
2521      NaN          USA  under18  2002   72936457.0
2522      NaN          USA    total  2003  290107933.0
2523      NaN          USA  under18  2003   73100758.0
2524      NaN          USA    total  2004  292805298.0
2525      NaN          USA  under18  2004   73297735.0
2526      NaN          USA    total  2005  295516599.0
2527      NaN          USA  under18  2005   73523669.0
2528      NaN          USA    total  2006  298379912.0
2529      NaN          USA  under18  2006   73757714.0
2530      NaN          USA    total  2007  301231207.0
2531      NaN          USA  under18  2007   74019405.0
2532      NaN          USA    total  2008  304093966.0
2533      NaN          USA  under18  2008   74104602.0
2534      NaN          USA  under18  2013   73585872.0
2535      NaN          USA    total  2013  316128839.0
2536      NaN          USA    total  2009  306771529.0
2537      NaN          USA  under18  2009   74134167.0
2538      NaN          USA  under18  2010   74119556.0
2539      NaN          USA    total  2010  309326295.0
2540      NaN          USA  under18  2011   73902222.0
2541      NaN          USA    total  2011  311582564.0
2542      NaN          USA  under18  2012   73708179.0
2543      NaN          USA    total  2012  313873685.0

[2544 rows x 5 columns]

查看存在缺失数据的列。

使用.isnull().any()，只有某一列存在一个缺失数据，就会显示True。

In [343]:
df_pop3.isnull().any() # isnull()有空值是True 没有空值是False any()只要有True就是True
# 合在一起使用 就是 这一列中 只要有空值就是true
# 接下来我们就要对空值进行处理了

state            True
state/region    False
ages            False
year            False
population       True
dtype: bool

找到有哪些state/region使得state的值为NaN，使用unique()查看非重复值

In [349]:
df_pop3["state"].isnull() #这是一个序列 有值是False 没有值是True
df_pop3[df_pop3["state"].isnull()] #DataFrame 后面 的中括号 中可以传入 序列 如果序列中是布尔值 False这这一项不取 True就取出这一项
df_pop3[df_pop3["state"].isnull()] # 取出来的都是有空值的
df_pop3[df_pop3["state"].isnull()]["state/region"].unique()

array(['PR', 'USA'], dtype=object)

为找到的这些state/region的state项补上正确的值，从而去除掉state这一列的所有NaN！

记住这样清除缺失数据NaN的方法！

In [393]:
# df_pop3[df_pop3["state"].isnull()]["state"] = "Puerto Rico" # 为了安全不能直接设置值
temp = df_pop3[df_pop3["state"].isnull()].copy()
temp["state"] = "Puerto Rico"
temp
temp2 = df_pop3[df_pop3["state/region"]=="USA"].copy()
temp2["state"]="United States"
temp2
df_pop3[df_pop3["state/region"]=="USA"] = temp2

In [394]:
df_pop3[df_pop3["state"].isnull()] = temp # 不能直接操作值 但是可以把DataFrame赋值给DataFrame
df_pop3.isnull().any()
df_pop4 = df_pop3.dropna()

In [395]:
df_pop4.isnull().any()

state           False
state/region    False
ages            False
year            False
population      False
dtype: bool

合并各州人口数据和面积数据areas，使用外合并。

思考一下为什么使用外合并？

In [417]:
df_pop_area = pd.merge(df_pop4,df_areas,how="outer")
df_pop_area.dropna()

            state state/region     ages  year  population  area (sq. mi)
0         Alabama           AL  under18  2012   1117489.0        52423.0
1         Alabama           AL    total  2012   4817528.0        52423.0
2         Alabama           AL  under18  2010   1130966.0        52423.0
3         Alabama           AL    total  2010   4785570.0        52423.0
4         Alabama           AL  under18  2011   1125763.0        52423.0
5         Alabama           AL    total  2011   4801627.0        52423.0
6         Alabama           AL    total  2009   4757938.0        52423.0
7         Alabama           AL  under18  2009   1134192.0        52423.0
8         Alabama           AL  under18  2013   1111481.0        52423.0
9         Alabama           AL    total  2013   4833722.0        52423.0
10        Alabama           AL    total  2007   4672840.0        52423.0
11        Alabama           AL  under18  2007   1132296.0        52423.0
12        Alabama           AL    total  2008   4718206.0        52423.0
13        Alabama           AL  under18  2008   1134927.0        52423.0
14        Alabama           AL    total  2005   4569805.0        52423.0
15        Alabama           AL  under18  2005   1117229.0        52423.0
16        Alabama           AL    total  2006   4628981.0        52423.0
17        Alabama           AL  under18  2006   1126798.0        52423.0
18        Alabama           AL    total  2004   4530729.0        52423.0
19        Alabama           AL  under18  2004   1113662.0        52423.0
20        Alabama           AL    total  2003   4503491.0        52423.0
21        Alabama           AL  under18  2003   1113083.0        52423.0
22        Alabama           AL    total  2001   4467634.0        52423.0
23        Alabama           AL  under18  2001   1120409.0        52423.0
24        Alabama           AL    total  2002   4480089.0        52423.0
25        Alabama           AL  under18  2002   1116590.0        52423.0
26        Alabama           AL  under18  1999   1121287.0        52423.0
27        Alabama           AL    total  1999   4430141.0        52423.0
28        Alabama           AL    total  2000   4452173.0        52423.0
29        Alabama           AL  under18  2000   1122273.0        52423.0
...           ...          ...      ...   ...         ...            ...
2446      Wyoming           WY  under18  1990    136078.0        97818.0
2447      Wyoming           WY    total  1990    453690.0        97818.0
2448  Puerto Rico           PR    total  2000   3810605.0         3515.0
2449  Puerto Rico           PR  under18  2000   1089063.0         3515.0
2450  Puerto Rico           PR    total  2001   3818774.0         3515.0
2451  Puerto Rico           PR  under18  2001   1077566.0         3515.0
2452  Puerto Rico           PR    total  2002   3823701.0         3515.0
2453  Puerto Rico           PR  under18  2002   1065051.0         3515.0
2454  Puerto Rico           PR    total  2004   3826878.0         3515.0
2455  Puerto Rico           PR  under18  2004   1035919.0         3515.0
2456  Puerto Rico           PR    total  2003   3826095.0         3515.0
2457  Puerto Rico           PR  under18  2003   1050615.0         3515.0
2458  Puerto Rico           PR    total  2005   3821362.0         3515.0
2459  Puerto Rico           PR  under18  2005   1019447.0         3515.0
2460  Puerto Rico           PR    total  2006   3805214.0         3515.0
2461  Puerto Rico           PR  under18  2006    998543.0         3515.0
2462  Puerto Rico           PR    total  2007   3782995.0         3515.0
2463  Puerto Rico           PR  under18  2007    973613.0         3515.0
2464  Puerto Rico           PR    total  2008   3760866.0         3515.0
2465  Puerto Rico           PR  under18  2008    945705.0         3515.0
2466  Puerto Rico           PR  under18  2013    814068.0         3515.0
2467  Puerto Rico           PR    total  2013   3615086.0         3515.0
2468  Puerto Rico           PR    total  2009   3740410.0         3515.0
2469  Puerto Rico           PR  under18  2009    920794.0         3515.0
2470  Puerto Rico           PR    total  2010   3721208.0         3515.0
2471  Puerto Rico           PR  under18  2010    896945.0         3515.0
2472  Puerto Rico           PR  under18  2011    869327.0         3515.0
2473  Puerto Rico           PR    total  2011   3686580.0         3515.0
2474  Puerto Rico           PR  under18  2012    841740.0         3515.0
2475  Puerto Rico           PR    total  2012   3651545.0         3515.0

[2476 rows x 6 columns]

     state/region     ages  year   population          state
0              AL  under18  2012    1117489.0        Alabama
1              AL    total  2012    4817528.0        Alabama
2              AL  under18  2010    1130966.0        Alabama
3              AL    total  2010    4785570.0        Alabama
4              AL  under18  2011    1125763.0        Alabama
5              AL    total  2011    4801627.0        Alabama
6              AL    total  2009    4757938.0        Alabama
7              AL  under18  2009    1134192.0        Alabama
8              AL  under18  2013    1111481.0        Alabama
9              AL    total  2013    4833722.0        Alabama
10             AL    total  2007    4672840.0        Alabama
11             AL  under18  2007    1132296.0        Alabama
12             AL    total  2008    4718206.0        Alabama
13             AL  under18  2008    1134927.0        Alabama
14             AL    total  2005    4569805.0        Alabama
15             AL  under18  2005    1117229.0        Alabama
16             AL    total  2006    4628981.0        Alabama
17             AL  under18  2006    1126798.0        Alabama
18             AL    total  2004    4530729.0        Alabama
19             AL  under18  2004    1113662.0        Alabama
20             AL    total  2003    4503491.0        Alabama
21             AL  under18  2003    1113083.0        Alabama
22             AL    total  2001    4467634.0        Alabama
23             AL  under18  2001    1120409.0        Alabama
24             AL    total  2002    4480089.0        Alabama
25             AL  under18  2002    1116590.0        Alabama
26             AL  under18  1999    1121287.0        Alabama
27             AL    total  1999    4430141.0        Alabama
28             AL    total  2000    4452173.0        Alabama
29             AL  under18  2000    1122273.0        Alabama
...           ...      ...   ...          ...            ...
2514          USA  under18  1999   71946051.0  United States
2515          USA    total  2000  282162411.0  United States
2516          USA  under18  2000   72376189.0  United States
2517          USA    total  1999  279040181.0  United States
2518          USA    total  2001  284968955.0  United States
2519          USA  under18  2001   72671175.0  United States
2520          USA    total  2002  287625193.0  United States
2521          USA  under18  2002   72936457.0  United States
2522          USA    total  2003  290107933.0  United States
2523          USA  under18  2003   73100758.0  United States
2524          USA    total  2004  292805298.0  United States
2525          USA  under18  2004   73297735.0  United States
2526          USA    total  2005  295516599.0  United States
2527          USA  under18  2005   73523669.0  United States
2528          USA    total  2006  298379912.0  United States
2529          USA  under18  2006   73757714.0  United States
2530          USA    total  2007  301231207.0  United States
2531          USA  under18  2007   74019405.0  United States
2532          USA    total  2008  304093966.0  United States
2533          USA  under18  2008   74104602.0  United States
2534          USA  under18  2013   73585872.0  United States
2535          USA    total  2013  316128839.0  United States
2536          USA    total  2009  306771529.0  United States
2537          USA  under18  2009   74134167.0  United States
2538          USA  under18  2010   74119556.0  United States
2539          USA    total  2010  309326295.0  United States
2540          USA  under18  2011   73902222.0  United States
2541          USA    total  2011  311582564.0  United States
2542          USA  under18  2012   73708179.0  United States
2543          USA    total  2012  313873685.0  United States

[2524 rows x 5 columns]

In [376]:
df_pop_area

            state state/region     ages  year   population  area (sq. mi)
0         Alabama           AL  under18  2012    1117489.0          52423
1         Alabama           AL    total  2012    4817528.0          52423
2         Alabama           AL  under18  2010    1130966.0          52423
3         Alabama           AL    total  2010    4785570.0          52423
4         Alabama           AL  under18  2011    1125763.0          52423
5         Alabama           AL    total  2011    4801627.0          52423
6         Alabama           AL    total  2009    4757938.0          52423
7         Alabama           AL  under18  2009    1134192.0          52423
8         Alabama           AL  under18  2013    1111481.0          52423
9         Alabama           AL    total  2013    4833722.0          52423
10        Alabama           AL    total  2007    4672840.0          52423
11        Alabama           AL  under18  2007    1132296.0          52423
12        Alabama           AL    total  2008    4718206.0          52423
13        Alabama           AL  under18  2008    1134927.0          52423
14        Alabama           AL    total  2005    4569805.0          52423
15        Alabama           AL  under18  2005    1117229.0          52423
16        Alabama           AL    total  2006    4628981.0          52423
17        Alabama           AL  under18  2006    1126798.0          52423
18        Alabama           AL    total  2004    4530729.0          52423
19        Alabama           AL  under18  2004    1113662.0          52423
20        Alabama           AL    total  2003    4503491.0          52423
21        Alabama           AL  under18  2003    1113083.0          52423
22        Alabama           AL    total  2001    4467634.0          52423
23        Alabama           AL  under18  2001    1120409.0          52423
24        Alabama           AL    total  2002    4480089.0          52423
25        Alabama           AL  under18  2002    1116590.0          52423
26        Alabama           AL  under18  1999    1121287.0          52423
27        Alabama           AL    total  1999    4430141.0          52423
28        Alabama           AL    total  2000    4452173.0          52423
29        Alabama           AL  under18  2000    1122273.0          52423
...           ...          ...      ...   ...          ...            ...
2494  Puerto Rico          USA  under18  1999   71946051.0           3515
2495  Puerto Rico          USA    total  2000  282162411.0           3515
2496  Puerto Rico          USA  under18  2000   72376189.0           3515
2497  Puerto Rico          USA    total  1999  279040181.0           3515
2498  Puerto Rico          USA    total  2001  284968955.0           3515
2499  Puerto Rico          USA  under18  2001   72671175.0           3515
2500  Puerto Rico          USA    total  2002  287625193.0           3515
2501  Puerto Rico          USA  under18  2002   72936457.0           3515
2502  Puerto Rico          USA    total  2003  290107933.0           3515
2503  Puerto Rico          USA  under18  2003   73100758.0           3515
2504  Puerto Rico          USA    total  2004  292805298.0           3515
2505  Puerto Rico          USA  under18  2004   73297735.0           3515
2506  Puerto Rico          USA    total  2005  295516599.0           3515
2507  Puerto Rico          USA  under18  2005   73523669.0           3515
2508  Puerto Rico          USA    total  2006  298379912.0           3515
2509  Puerto Rico          USA  under18  2006   73757714.0           3515
2510  Puerto Rico          USA    total  2007  301231207.0           3515
2511  Puerto Rico          USA  under18  2007   74019405.0           3515
2512  Puerto Rico          USA    total  2008  304093966.0           3515
2513  Puerto Rico          USA  under18  2008   74104602.0           3515
2514  Puerto Rico          USA  under18  2013   73585872.0           3515
2515  Puerto Rico          USA    total  2013  316128839.0           3515
2516  Puerto Rico          USA    total  2009  306771529.0           3515
2517  Puerto Rico          USA  under18  2009   74134167.0           3515
2518  Puerto Rico          USA  under18  2010   74119556.0           3515
2519  Puerto Rico          USA    total  2010  309326295.0           3515
2520  Puerto Rico          USA  under18  2011   73902222.0           3515
2521  Puerto Rico          USA    total  2011  311582564.0           3515
2522  Puerto Rico          USA  under18  2012   73708179.0           3515
2523  Puerto Rico          USA    total  2012  313873685.0           3515

[2524 rows x 6 columns]

找出2010年的全民人口数据,df.query(查询语句)

In [418]:
df_2010 = df_pop_area.query("year==2010 & ages=='total'")
df_2010.shape
df_2010.dropna()

,state,state/region,ages,year,population,area (sq. mi)
3,Alabama,AL,total,2010,4785570.0,52423.0
91,Alaska,AK,total,2010,713868.0,656425.0
101,Arizona,AZ,total,2010,6408790.0,114006.0
189,Arkansas,AR,total,2010,2922280.0,53182.0
197,California,CA,total,2010,37333601.0,163707.0
283,Colorado,CO,total,2010,5048196.0,104100.0
293,Connecticut,CT,total,2010,3579210.0,5544.0
379,Delaware,DE,total,2010,899711.0,1954.0
389,District of Columbia,DC,total,2010,605125.0,68.0
475,Florida,FL,total,2010,18846054.0,65758.0
485,Georgia,GA,total,2010,9713248.0,59441.0
570,Hawaii,HI,total,2010,1363731.0,10932.0
581,Idaho,ID,total,2010,1570718.0,83574.0
666,Illinois,IL,total,2010,12839695.0,57918.0
677,Indiana,IN,total,2010,6489965.0,36420.0
762,Iowa,IA,total,2010,3050314.0,56276.0
773,Kansas,KS,total,2010,2858910.0,82282.0
858,Kentucky,KY,total,2010,4347698.0,40411.0
869,Louisiana,LA,total,2010,4545392.0,51843.0
954,Maine,ME,total,2010,1327366.0,35387.0
965,Montana,MT,total,2010,990527.0,147046.0
1050,Nebraska,NE,total,2010,1829838.0,77358.0
1061,Nevada,NV,total,2010,2703230.0,110567.0
1146,New Hampshire,NH,total,2010,1316614.0,9351.0
1157,New Jersey,NJ,total,2010,8802707.0,8722.0
1242,New Mexico,NM,total,2010,2064982.0,121593.0
1253,New York,NY,total,2010,19398228.0,54475.0
1338,North Carolina,NC,total,2010,9559533.0,53821.0
1349,North Dakota,ND,total,2010,674344.0,70704.0
1434,Ohio,OH,total,2010,11545435.0,44828.0
1445,Oklahoma,OK,total,2010,3759263.0,69903.0
1530,Oregon,OR,total,2010,3837208.0,98386.0
1541,Maryland,MD,total,2010,5787193.0,12407.0
1626,Massachusetts,MA,total,2010,6563263.0,10555.0
1637,Michigan,MI,total,2010,9876149.0,96810.0
1722,Minnesota,MN,total,2010,5310337.0,86943.0
1733,Mississippi,MS,total,2010,2970047.0,48434.0
1818,Missouri,MO,total,2010,5996063.0,69709.0
1829,Pennsylvania,PA,total,2010,12710472.0,46058.0
1914,Rhode Island,RI,total,2010,1052669.0,1545.0
1925,South Carolina,SC,total,2010,4636361.0,32007.0
2010,South Dakota,SD,total,2010,816211.0,77121.0
2021,Tennessee,TN,total,2010,6356683.0,42146.0
2106,Texas,TX,total,2010,25245178.0,268601.0
2117,Utah,UT,total,2010,2774424.0,84904.0
2202,Vermont,VT,total,2010,625793.0,9615.0
2213,Virginia,VA,total,2010,8024417.0,42769.0
2298,Washington,WA,total,2010,6742256.0,71303.0
2309,West Virginia,WV,total,2010,1854146.0,24231.0
2394,Wisconsin,WI,total,2010,5689060.0,65503.0
2405,Wyoming,WY,total,2010,564222.0,97818.0
2470,Puerto Rico,PR,total,2010,3721208.0,3515.0

对查询结果进行处理，以state列作为新的行索引:set_index

In [426]:
df_2010.set_index("state")

                     state/region   ages  year   population  area (sq. mi)
state
Alabama                        AL  total  2010    4785570.0        52423.0
Alaska                         AK  total  2010     713868.0       656425.0
Arizona                        AZ  total  2010    6408790.0       114006.0
Arkansas                       AR  total  2010    2922280.0        53182.0
California                     CA  total  2010   37333601.0       163707.0
Colorado                       CO  total  2010    5048196.0       104100.0
Connecticut                    CT  total  2010    3579210.0         5544.0
Delaware                       DE  total  2010     899711.0         1954.0
District of Columbia           DC  total  2010     605125.0           68.0
Florida                        FL  total  2010   18846054.0        65758.0
Georgia                        GA  total  2010    9713248.0        59441.0
Hawaii                         HI  total  2010    1363731.0        10932.0
Idaho                          ID  total  2010    1570718.0        83574.0
Illinois                       IL  total  2010   12839695.0        57918.0
Indiana                        IN  total  2010    6489965.0        36420.0
Iowa                           IA  total  2010    3050314.0        56276.0
Kansas                         KS  total  2010    2858910.0        82282.0
Kentucky                       KY  total  2010    4347698.0        40411.0
Louisiana                      LA  total  2010    4545392.0        51843.0
Maine                          ME  total  2010    1327366.0        35387.0
Montana                        MT  total  2010     990527.0       147046.0
Nebraska                       NE  total  2010    1829838.0        77358.0
Nevada                         NV  total  2010    2703230.0       110567.0
New Hampshire                  NH  total  2010    1316614.0         9351.0
New Jersey                     NJ  total  2010    8802707.0         8722.0
New Mexico                     NM  total  2010    2064982.0       121593.0
New York                       NY  total  2010   19398228.0        54475.0
North Carolina                 NC  total  2010    9559533.0        53821.0
North Dakota                   ND  total  2010     674344.0        70704.0
Ohio                           OH  total  2010   11545435.0        44828.0
Oklahoma                       OK  total  2010    3759263.0        69903.0
Oregon                         OR  total  2010    3837208.0        98386.0
Maryland                       MD  total  2010    5787193.0        12407.0
Massachusetts                  MA  total  2010    6563263.0        10555.0
Michigan                       MI  total  2010    9876149.0        96810.0
Minnesota                      MN  total  2010    5310337.0        86943.0
Mississippi                    MS  total  2010    2970047.0        48434.0
Missouri                       MO  total  2010    5996063.0        69709.0
Pennsylvania                   PA  total  2010   12710472.0        46058.0
Rhode Island                   RI  total  2010    1052669.0         1545.0
South Carolina                 SC  total  2010    4636361.0        32007.0
South Dakota                   SD  total  2010     816211.0        77121.0
Tennessee                      TN  total  2010    6356683.0        42146.0
Texas                          TX  total  2010   25245178.0       268601.0
Utah                           UT  total  2010    2774424.0        84904.0
Vermont                        VT  total  2010     625793.0         9615.0
Virginia                       VA  total  2010    8024417.0        42769.0
Washington                     WA  total  2010    6742256.0        71303.0
West Virginia                  WV  total  2010    1854146.0        24231.0
Wisconsin                      WI  total  2010    5689060.0        65503.0
Wyoming                        WY  total  2010     564222.0        97818.0
Puerto Rico                    PR  total  2010    3721208.0         3515.0
United States                 USA  total  2010  309326295.0            NaN

计算人口密度。注意是Series/Series，其结果还是一个Series。

In [430]:
df_2010 = df_2010.dropna()

In [416]:
df_2010["area (sq. mi)"]

3        52423.0
91      656425.0
101     114006.0
189      53182.0
197     163707.0
283     104100.0
293       5544.0
379       1954.0
389         68.0
475      65758.0
485      59441.0
570      10932.0
581      83574.0
666      57918.0
677      36420.0
762      56276.0
773      82282.0
858      40411.0
869      51843.0
954      35387.0
965     147046.0
1050     77358.0
1061    110567.0
1146      9351.0
1157      8722.0
1242    121593.0
1253     54475.0
1338     53821.0
1349     70704.0
1434     44828.0
1445     69903.0
1530     98386.0
1541     12407.0
1626     10555.0
1637     96810.0
1722     86943.0
1733     48434.0
1818     69709.0
1829     46058.0
1914      1545.0
1925     32007.0
2010     77121.0
2021     42146.0
2106    268601.0
2117     84904.0
2202      9615.0
2213     42769.0
2298     71303.0
2309     24231.0
2394     65503.0
2405     97818.0
2470      3515.0
2519         NaN
Name: area (sq. mi), dtype: float64

In [431]:
dens = df_2010["population"]/df_2010["area (sq. mi)"]
dens

3         91.287603
91         1.087509
101       56.214497
189       54.948667
197      228.051342
283       48.493718
293      645.600649
379      460.445752
389     8898.897059
475      286.597129
485      163.409902
570      124.746707
581       18.794338
666      221.687472
677      178.197831
762       54.202751
773       34.745266
858      107.586994
869       87.676099
954       37.509990
965        6.736171
1050      23.654153
1061      24.448796
1146     140.799273
1157    1009.253268
1242      16.982737
1253     356.094135
1338     177.617157
1349       9.537565
1434     257.549634
1445      53.778278
1530      39.001565
1541     466.445797
1626     621.815538
1637     102.015794
1722      61.078373
1733      61.321530
1818      86.015622
1829     275.966651
1914     681.339159
1925     144.854594
2010      10.583512
2021     150.825298
2106      93.987655
2117      32.677188
2202      65.085075
2213     187.622273
2298      94.557817
2309      76.519582
2394      86.851900
2405       5.768079
2470    1058.665149
dtype: float64

排序，并找出人口密度最高的五个州sort_values()的密度

In [434]:
type(dens.sort_values().tail(6))
# dens.sort_values().tail(6).iloc[:-1]
dens.sort_values().tail(5)

293      645.600649
1914     681.339159
1157    1009.253268
2470    1058.665149
389     8898.897059
dtype: float64

找出人口密度最低的五个州的密度

In [421]:
dens.sort_values().head()

91       1.087509
2405     5.768079
965      6.736171
1349     9.537565
2010    10.583512
dtype: float64

要点总结：
- 统一用loc()索引
- 善于使用.isnull().any()找到存在NaN的列
- 善于使用.unique()确定该列中哪些key是我们需要的
- 一般使用外合并、左合并，目的只有一个：宁愿该列是NaN也不要丢弃其他列的信息